"""
在一个由小写字母构成的字符串 S 中，包含由一些连续的相同字符所构成的分组。

例如，在字符串 S = "abbxxxxzyy" 中，就含有 "a", "bb", "xxxx", "z" 和 "yy" 这样的一些分组。

我们称所有包含大于或等于三个连续字符的分组为较大分组。找到每一个较大分组的起始和终止位置。

最终结果按照字典顺序输出。

示例 1:

输入: "abbxxxxzzy"
输出: [[3,6]]
解释: "xxxx" 是一个起始于 3 且终止于 6 的较大分组。
示例 2:

输入: "abc"
输出: []
解释: "a","b" 和 "c" 均不是符合要求的较大分组。
示例 3:

输入: "abcdddeeeeaabbbcd"
输出: [[3,5],[6,9],[12,14]]
"""


class Solution:
    """
    思想：双指针
        维护两个指针i，j，分别为分组的左端点和右端点，且i <= j。不断增加j的值，直到S{i] != S[j]
        为止。对应的分组为[i,j]。并开始寻找下一个分组

    """
    def largeGroupPositions(self, S):
        ans = []
        i = 0
        for j in range(len(S)):
            # 直到j走到了最后，或者j与j+1的值不同为止
            if j == len(S) - 1 or S[j] != S[j + 1]:
                # 当长度大于等于3
                if j - i + 1 >= 3:
                    # 添加至分组
                    ans.append([i, j])
                i = j + 1
        return ans
